
# 姓名  语文 数学 python
# fotmat 函数
a = "张三"
a1 = "张三丰1"
b = 71
c = 78
d = 89
# print("小明的成绩是：{}分，数学成绩：{}分".format(a,b))
# print("小明的成绩是：{}分，数学成绩：{}分".format(a,b))
# print("小明的成绩是：{}分，数学成绩：{}分".format(a,b))
#
# {:4} 4个位置，默认左对齐
# {:<4} 左对齐
# {:^}  中间对齐
# {:>}  右对齐
# 上下对齐 \t
print("-------------------------")
print("{:^4}\t{:6}\t{:4}\t{:^8}".format("姓名","语文","数学","python"))
print("-------------------------")
print("{:^4}\t{:^4}\t{:^4}\t{:^8}".format(a,b,c,d))
print("-------------------------")
print("{:^4}\t{:^4}\t{:^4}\t{:^8}".format(a1,b,c,d))
print("-------------------------")